panda5mt/RA8E1_prj/src/main_thread1_entry.c
#include "main_thread1.h"
#include "putchar_ra8usb.h"
#include "hal_data.h"
#include "hyperram_integ.h"
#include "video_frame_buffer.h"
#include "verify_mode.h"

#include "lwip/tcpip.h"
#include "lwip/netif.h"
#include "lwip/netifapi.h"
#include "lwip/ip4_addr.h"
#include "lwip/udp.h"
#include "lwip/pbuf.h"
#include "lwip/dhcp.h"
#if LWIP_AUTOIP
#include "lwip/autoip.h"
#endif

#include <stdint.h>

#include "ra/fsp/src/bsp/mcu/all/bsp_io.h"

#if APP_MODE_FFT_VERIFY && APP_MODE_FFT_VERIFY_DISABLE_UDP
void main_thread1_entry(void *pvParameters)
{
    FSP_PARAMETER_NOT_USED(pvParameters);
    xprintf("[Thread1] APP_MODE_FFT_VERIFY=1: UDP/LwIP disabled\n");
    while (1)
    {
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

#else

typedef enum
{
    YUV422_ORDER_UNKNOWN = 0,
    YUV422_ORDER_YUYV = 1,        /* [Y0 U0 Y1 V0] */
    YUV422_ORDER_UYVY = 2,        /* [U0 Y0 V0 Y1] */
    YUV422_ORDER_VYUY = 3,        /* [V0 Y1 U0 Y0] */
    YUV422_ORDER_YUYV_SWAP_Y = 4, /* swap Y within each pair: output (Y1,Y0) */
    YUV422_ORDER_UYVY_SWAP_Y = 5  /* swap Y within each pair: output (Y1,Y0) */
} yuv422_order_t;

/*
 * YUV422バイト順の固定設定(MATLAB側は変更しない前提)
 * CEU設定が CB0Y0CR0Y1 (= UYVY) のため，デフォルトは UYVY．
 * もし「Y成分っぽいが，偶奇ピクセルが入れ替わって見える」場合は
 *   - YUV422_ORDER_UYVY_SWAP_Y
 *   - YUV422_ORDER_YUYV_SWAP_Y
 * を試してください(Yのみを入れ替えます)．
 */
#ifndef UDP_GRAYSCALE_YUV422_ORDER
#define UDP_GRAYSCALE_YUV422_ORDER YUV422_ORDER_UYVY_SWAP_Y
#endif

static const yuv422_order_t g_yuv422_order_fixed = (yuv422_order_t)UDP_GRAYSCALE_YUV422_ORDER;

/*
 * 4px束の順番補正(グレースケール送信のみ)
 * 0: 無効
 * 1: 4px(=4バイト)ごとに [0..1] と [2..3] を入れ替え (Y2 Y3 Y0 Y1 型)
 */
#ifndef UDP_GRAYSCALE_REORDER_4PX_MODE
#define UDP_GRAYSCALE_REORDER_4PX_MODE 1
#endif

static inline void reorder_grayscale_4px(uint8_t *buf, uint32_t n)
{
#if UDP_GRAYSCALE_REORDER_4PX_MODE == 1
    /* n is expected to be multiple of 4 (chunk_size=512 is OK) */
    for (uint32_t i = 0; i + 3U < n; i += 4U)
    {
        uint8_t a0 = buf[i];
        uint8_t a1 = buf[i + 1U];
        buf[i] = buf[i + 2U];
        buf[i + 1U] = buf[i + 3U];
        buf[i + 2U] = a0;
        buf[i + 3U] = a1;
    }
#else
    (void)buf;
    (void)n;
#endif
}

static void extract_y_from_yuv422(const uint8_t *yuv, uint8_t *y_out, uint32_t y_bytes, yuv422_order_t order)
{
    /* y_bytes must be even: 2 pixels at a time */
    for (uint32_t i = 0; i < y_bytes; i += 2)
    {
        uint32_t yuv_idx = i * 2U;
        if (order == YUV422_ORDER_UYVY)
        {
            /* [U0 Y0 V0 Y1] */
            y_out[i] = yuv[yuv_idx + 1];
            y_out[i + 1] = yuv[yuv_idx + 3];
        }
        else if (order == YUV422_ORDER_UYVY_SWAP_Y)
        {
            /* [U0 Y0 V0 Y1] but swap Y: (Y1,Y0) */
            y_out[i] = yuv[yuv_idx + 3];
            y_out[i + 1] = yuv[yuv_idx + 1];
        }
        else if (order == YUV422_ORDER_VYUY)
        {
            /* [V0 Y1 U0 Y0] */
            y_out[i] = yuv[yuv_idx + 3];
            y_out[i + 1] = yuv[yuv_idx + 1];
        }
        else if (order == YUV422_ORDER_YUYV_SWAP_Y)
        {
            /* [Y0 U0 Y1 V0] but swap Y: (Y1,Y0) */
            y_out[i] = yuv[yuv_idx + 2];
            y_out[i + 1] = yuv[yuv_idx + 0];
        }
        else
        {
            /* default YUYV: [Y0 U0 Y1 V0] */
            y_out[i] = yuv[yuv_idx + 0];
            y_out[i + 1] = yuv[yuv_idx + 2];
        }
    }

    reorder_grayscale_4px(y_out, y_bytes);
}

#define UDP_PORT_DEST 9000
#define FRAME_SIZE (320 * 240 * 2)    // YUV422 = 2 bytes/pixel
#define MONO_OFFSET FRAME_SIZE        // モノクロ画像オフセット
#define GRADIENT_OFFSET FRAME_SIZE    // p,q勾配マップオフセット(MONO_OFFSETと同じ位置)
#define DEPTH_OFFSET (FRAME_SIZE * 2) // 深度マップオフセット(8bit grayscale: 320×240 = 76,800バイト)

/*
 * UDP pacing:
 * Sending back-to-back (0ms) can easily overrun the receiver (PC/MATLAB) and
 * cause frequent chunk loss -> many missing chunks during frame reconstruction.
 * Tune these values depending on your LAN and PC load.
 */
#ifndef UDP_PACKET_INTERVAL_MS
#define UDP_PACKET_INTERVAL_MS 1
#endif

#ifndef UDP_FRAME_INTERVAL_MS
#define UDP_FRAME_INTERVAL_MS 5
#endif

// ---- Optional debug: select what to stream in video mode ----
// 0: normal grayscale (Y)
// 1: stream p (dx) from Thread3 PQ128 buffer
// 2: stream q (dy) from Thread3 PQ128 buffer
// 3: stream depth (u8 320x240) from Thread3 FC output
#ifndef UDP_VIDEO_SOURCE
#define UDP_VIDEO_SOURCE 3 // default: depth (u8 320x240)
#endif

#define PQ128_SIZE (128)
#define PQ128_X0 ((320 - PQ128_SIZE) / 2)
#define PQ128_Y0 ((240 - PQ128_SIZE) / 2)
#define PQ128_PLANE_BYTES ((uint32_t)(PQ128_SIZE * PQ128_SIZE * (uint32_t)sizeof(int16_t)))
#define PQ128_P_OFFSET (FRAME_SIZE) /* same as GRADIENT_OFFSET in Thread3 */
#define PQ128_Q_OFFSET (PQ128_P_OFFSET + PQ128_PLANE_BYTES)

static inline uint8_t pq16_to_u8(int16_t v)
{
    // Central difference range ~[-255..255]. Compress by /2 to map to [-127..127], then bias.
    int x = ((int)v) / 2 + 128;
    if (x < 0)
        x = 0;
    if (x > 255)
        x = 255;
    return (uint8_t)x;
}

static void fill_pq_debug_chunk(uint8_t *out, uint32_t out_bytes, uint32_t pixel_base)
{
    // If PQ isn't ready, paint mid-gray.
    uint32_t seq = g_pq128_seq;
    uint32_t pq_base = g_pq128_base_offset;
    if (seq == 0U)
    {
        memset(out, 128, out_bytes);
        return;
    }

    int16_t row_buf[PQ128_SIZE];
    int cached_ry = -1;

    for (uint32_t i = 0; i < out_bytes; i++)
    {
        uint32_t pix = pixel_base + i;
        uint32_t x = pix % 320U;
        uint32_t y = pix / 320U;
        if (y >= 240U)
        {
            out[i] = 128;
            continue;
        }

        if (x < (uint32_t)PQ128_X0 || x >= (uint32_t)(PQ128_X0 + PQ128_SIZE) ||
            y < (uint32_t)PQ128_Y0 || y >= (uint32_t)(PQ128_Y0 + PQ128_SIZE))
        {
            out[i] = 128;
            continue;
        }

        int rx = (int)x - PQ128_X0;
        int ry = (int)y - PQ128_Y0;
        if (ry != cached_ry)
        {
            uint32_t row_off = (uint32_t)ry * (uint32_t)PQ128_SIZE * (uint32_t)sizeof(int16_t);
            uint32_t plane_off = (UDP_VIDEO_SOURCE == 2) ? PQ128_Q_OFFSET : PQ128_P_OFFSET;
            (void)hyperram_b_read(row_buf, (void *)(pq_base + plane_off + row_off), (uint32_t)PQ128_SIZE * (uint32_t)sizeof(int16_t));
            cached_ry = ry;
        }

