panda5mt/RA8E1_prj/src/main_thread1_entry.c
        out[i] = pq16_to_u8(row_buf[rx]);
    }
}

// UDP写真データチャンクヘッダー
typedef struct __attribute__((packed))
{
    uint32_t magic_number;    // マジックナンバー (0x12345678)
    uint32_t total_size;      // 写真データの総サイズ
    uint32_t chunk_index;     // 現在のチャンクインデックス (0から開始)
    uint32_t total_chunks;    // 総チャンク数
    uint32_t chunk_offset;    // このチャンクのオフセット(バイト)
    uint16_t chunk_data_size; // このチャンクのデータサイズ
    uint16_t checksum;        // ヘッダーのチェックサム
} udp_photo_header_t;

static void netif_status_cb(struct netif *n);
static void udp_rx_cb(void *arg, struct udp_pcb *upcb, struct pbuf *p,
                      const ip_addr_t *addr, u16_t port);
typedef struct
{
    struct udp_pcb *pcb;
    ip_addr_t dest_ip;
    const char *msg;
    uint16_t port;
    int remaining;
    uint32_t interval_ms;
    // 写真データ送信用の追加フィールド
    uint8_t *photo_data; // 写真データのポインタ
    uint32_t photo_size; // 写真データの総サイズ
    uint32_t sent_bytes; // 送信済みバイト数
    uint32_t chunk_size; // 1回の送信サイズ(512バイト)
    bool is_photo_mode;  // 写真モードかどうか

    // マルチフレーム動画送信用
    bool is_video_mode;
    uint32_t current_frame;
    uint32_t total_frames;
    uint32_t frame_interval_ms; // フレーム間の待機時間
    bool is_frame_complete;

    /* HyperRAM base offset for the current video frame (snapshotted). */
    uint32_t frame_base_offset;

    /*
     * For depth streaming, keep the last completed depth buffer snapshot.
     * This avoids flicker to gray while the next depth is being computed.
     */
    uint32_t depth_base_offset;
    uint32_t depth_seq_snapshot;
    uint32_t depth_size_snapshot;
} udp_send_ctx_t;
static void udp_send_timer_cb(void *arg);

// ヘッダーチェックサム計算
static uint16_t calc_header_checksum(udp_photo_header_t *header)
{
    uint16_t *data = (uint16_t *)header;
    uint32_t sum = 0;
    size_t len = (sizeof(udp_photo_header_t) - sizeof(uint16_t)) / sizeof(uint16_t); // checksumフィールド除く

    for (size_t i = 0; i < len; i++)
    {
        sum += data[i];
    }

    while (sum >> 16)
    {
        sum = (sum & 0xFFFF) + (sum >> 16);
    }

    return (uint16_t)(~sum);
}

/* DHCP完了待ち用セマフォ */
static SemaphoreHandle_t g_ip_ready_sem = NULL;

/* 静的UDP送信コンテキスト(ヒープ不要) */
static udp_send_ctx_t g_udp_send_ctx;

/* ====== 受信コールバック ====== */
static void udp_rx_cb(void *arg, struct udp_pcb *upcb, struct pbuf *p,
                      const ip_addr_t *addr, u16_t port)
{
    FSP_PARAMETER_NOT_USED(arg);
    FSP_PARAMETER_NOT_USED(upcb);
    if (!p)
    {
        return;
    }

    char head[65] = {0};
    u16_t cpy = (p->tot_len < 64) ? p->tot_len : 64;
    /* p->payload は線形とは限らないが，ここでは小さく読むだけなので p->payload を直接 */
    memcpy(head, p->payload, cpy);

    xprintf("[UDP RX] %s:%u len=%u data=\"%s\"\n",
            ip4addr_ntoa(ip_2_ip4(addr)), port, p->tot_len, head);

    pbuf_free(p);
}

/* ====== 送信タイマ(tcpip_thread 上で実行) ====== */
static void udp_send_timer_cb(void *arg)
{
    udp_send_ctx_t *ctx = (udp_send_ctx_t *)arg;
    if (!ctx || !ctx->pcb)
        return;

    struct pbuf *p;
    size_t send_size;

    if (ctx->is_video_mode || ctx->is_photo_mode)
    {
        /* Snapshot base at the start of each frame to avoid mid-frame base changes. */
        if (ctx->is_video_mode && (ctx->sent_bytes == 0U))
        {
            if (UDP_VIDEO_SOURCE == 3)
            {
                /* Depth: snapshot last completed depth; keep previous if not ready yet. */
                uint32_t depth_seq = (uint32_t)g_depth_seq;
                if (depth_seq != 0U)
                {
                    ctx->depth_seq_snapshot = depth_seq;
                    ctx->depth_base_offset = (uint32_t)g_depth_base_offset;
                    uint32_t sz = (uint32_t)g_depth_size_bytes;
                    if (sz != 0U)
                    {
                        ctx->depth_size_snapshot = sz;
                        ctx->photo_size = sz;
                    }
                }
            }
            else
            {
                ctx->frame_base_offset = (uint32_t)g_video_frame_base_offset;
            }
        }

        // 動画・写真データモード：512バイトずつ送信
        uint32_t remaining_bytes = ctx->photo_size - ctx->sent_bytes;
        send_size = (remaining_bytes < ctx->chunk_size) ? remaining_bytes : ctx->chunk_size;

        /* Only grayscale (YUV422->Y) requires even/4-byte alignment. */
        if (UDP_VIDEO_SOURCE == 0)
        {
            /* Y成分抽出は2ピクセル(=2バイト)単位で行うため偶数に丸める */
            send_size &= ~(size_t)1U;
#if UDP_GRAYSCALE_REORDER_4PX_MODE == 1
            /* 4px束並び替えを行う場合，4バイト境界に揃える */
            send_size &= ~(size_t)3U;
#endif
        }

        // ヘッダー + データのサイズでバッファを確保
        size_t total_packet_size = sizeof(udp_photo_header_t) + send_size;
        p = pbuf_alloc(PBUF_TRANSPORT, (u16_t)total_packet_size, PBUF_RAM);

        if (!p)
        {
            // pbuf確保失敗時は短い間隔でリトライ(間隔0でも安全)
            sys_timeout((ctx->interval_ms > 0) ? ctx->interval_ms : 1, udp_send_timer_cb, ctx);
            return;
        }

        if (p)
        {
            // ヘッダーを作成
            udp_photo_header_t header;
            header.magic_number = 0x12345678;
            header.total_size = ctx->photo_size;
            header.chunk_index = ctx->sent_bytes / ctx->chunk_size;
            header.total_chunks = (ctx->photo_size + ctx->chunk_size - 1) / ctx->chunk_size;
            header.chunk_offset = ctx->sent_bytes;
            header.chunk_data_size = (uint16_t)send_size;
            header.checksum = calc_header_checksum(&header);

            // パケットにヘッダーをコピー
            memcpy(p->payload, &header, sizeof(udp_photo_header_t));

            // HyperRAMからYUV422データを読み込み，Y成分のみを抽出してグレースケール送信
            uint8_t *dest_ptr = (uint8_t *)p->payload + sizeof(udp_photo_header_t);

            // YUV422から必要なバイト数の2倍を読み込む(Y成分は2バイトごと)
            uint8_t yuv_buffer[1024]; // 一時バッファ(最大512バイトのグレースケール = 1024バイトのYUV422)
            uint32_t yuv_read_size = (uint32_t)(send_size * 2U);
            uint32_t yuv_offset = (uint32_t)(ctx->sent_bytes * 2U); // グレースケールオフセットをYUV422オフセットに変換

            if (yuv_read_size > sizeof(yuv_buffer))
            {
                /* 想定外(chunk_size変更など): バッファに収まる範囲へ制限 */
                yuv_read_size = (uint32_t)sizeof(yuv_buffer);
                send_size = (size_t)(yuv_read_size / 2U);
            }

