panda5mt/RA8E1_prj/src/main_thread1_entry.c
            uint32_t base = ctx->is_video_mode ? ctx->frame_base_offset : 0U;
            /*
             * IMPORTANT:
             * This callback runs on lwIP's tcpip_thread. Never block it for seconds.
             * If HyperRAM is busy (e.g. camera frame write / WV retries), reschedule
             * quickly and try again.
             */
            if (UDP_VIDEO_SOURCE == 1 || UDP_VIDEO_SOURCE == 2)
            {
                /* Stream PQ128 debug view as a 320x240 grayscale image. */
                fill_pq_debug_chunk(dest_ptr, (uint32_t)send_size, (uint32_t)ctx->sent_bytes);
            }
            else if (UDP_VIDEO_SOURCE == 3)
            {
                /* Stream depth (already 8-bit grayscale) from HyperRAM. */
                if (ctx->depth_seq_snapshot == 0U)
                {
                    memset(dest_ptr, 128, send_size);
                }
                else
                {
                    fsp_err_t derr = hyperram_b_read_timed(dest_ptr,
                                                           (void *)(ctx->depth_base_offset + (uint32_t)DEPTH_OFFSET + (uint32_t)ctx->sent_bytes),
                                                           (uint32_t)send_size,
                                                           0);
                    if (FSP_SUCCESS != derr)
                    {
                        pbuf_free(p);
                        if (FSP_ERR_TIMEOUT != derr)
                        {
                            xprintf("[UDP] Depth read error: %d\n", derr);
                        }
                        sys_timeout((ctx->interval_ms > 0) ? ctx->interval_ms : 1, udp_send_timer_cb, ctx);
                        return;
                    }
                }
            }
            else
            {
                fsp_err_t read_err = hyperram_b_read_timed(yuv_buffer, (void *)(base + yuv_offset), yuv_read_size, 0);
                if (FSP_SUCCESS != read_err)
                {
                    pbuf_free(p);
                    if (FSP_ERR_TIMEOUT != read_err)
                    {
                        xprintf("[UDP] HyperRAM read error: %d\n", read_err);
                    }
                    sys_timeout((ctx->interval_ms > 0) ? ctx->interval_ms : 1, udp_send_timer_cb, ctx);
                    return;
                }

                extract_y_from_yuv422(yuv_buffer, dest_ptr, (uint32_t)send_size, g_yuv422_order_fixed);
            }

            err_t e = udp_sendto(ctx->pcb, p, &ctx->dest_ip, ctx->port);
            pbuf_free(p);

            if (e == ERR_OK)
            {
                ctx->sent_bytes += send_size;
                // ログ出力を大幅に削減(パフォーマンス向上)
                if ((ctx->sent_bytes / ctx->chunk_size) % 100 == 0)
                {
                    if (ctx->is_video_mode)
                    {
                        // xprintf("[VIDEO] F%u: %u/%u\n", ctx->current_frame + 1, ctx->sent_bytes, ctx->photo_size);
                    }
                }
            }
            // ログ出力を最小限に抑制(高速化)
            // 動画モードではログをほぼ出力しない
        }
    }
    else
    {
        // 従来のテキストメッセージモード
        static char dynamic_msg[128];
        uint32_t timestamp = xTaskGetTickCount();
        snprintf(dynamic_msg, sizeof(dynamic_msg),
                 "RA8E1 UDP Message #%d at %u ms",
                 101 - ctx->remaining, (unsigned int)(timestamp * portTICK_PERIOD_MS));

        send_size = strlen(dynamic_msg);
        p = pbuf_alloc(PBUF_TRANSPORT, (u16_t)send_size, PBUF_RAM);
        if (p)
        {
            memcpy(p->payload, dynamic_msg, send_size);
            err_t e = udp_sendto(ctx->pcb, p, &ctx->dest_ip, ctx->port);
            pbuf_free(p);
            xprintf("[UDP] send %s, remain=%d\n", (e == ERR_OK) ? "OK" : "NG", ctx->remaining - 1);
        }
    }

    if (!p)
    {
        xprintf("[UDP] pbuf_alloc failed\n");
    }

    // 継続条件の判定
    bool should_continue = false;
    uint32_t next_interval = ctx->interval_ms;

    if (ctx->is_video_mode)
    {
        if (ctx->sent_bytes < ctx->photo_size)
        {
            // 現在のフレーム内でパケット送信継続
            should_continue = true;
            ctx->is_frame_complete = false;
        }
        else
        {
            // 現在のフレーム完了
            ctx->current_frame++;
            ctx->is_frame_complete = true;

            // total_frames == UINT32_MAX (0xFFFFFFFF) なら無制限ループ
            bool is_unlimited = (ctx->total_frames == UINT32_MAX);

            if (is_unlimited || ctx->current_frame < ctx->total_frames)
            {
                // 次のフレームがある：フレーム間インターバルで待機
                ctx->sent_bytes = 0; // 次フレーム用にリセット
                if (UDP_VIDEO_SOURCE == 3)
                {
                    /* Refresh snapshot if a new depth becomes available. */
                    uint32_t depth_seq = (uint32_t)g_depth_seq;
                    if (depth_seq != 0U)
                    {
                        ctx->depth_seq_snapshot = depth_seq;
                        ctx->depth_base_offset = (uint32_t)g_depth_base_offset;
                        uint32_t sz = (uint32_t)g_depth_size_bytes;
                        if (sz != 0U)
                        {
                            ctx->depth_size_snapshot = sz;
                            ctx->photo_size = sz;
                        }
                    }
                }
                else
                {
                    ctx->frame_base_offset = (uint32_t)g_video_frame_base_offset;
                }
                should_continue = true;
                next_interval = ctx->frame_interval_ms; // フレーム間は長めの間隔
                // ログ出力を削減(100フレームごと)
                if (ctx->current_frame % 100 == 0)
                {
                    if (is_unlimited)
                    {
                        xprintf("[VIDEO] F%u (unlimited) done\n", ctx->current_frame);
                    }
                    else
                    {
                        xprintf("[VIDEO] F%u/%u done\n", ctx->current_frame, ctx->total_frames);
                    }
                }
            }
            else
            {
                // 全フレーム完了
                xprintf("[VIDEO] All %u frames transmitted\n", ctx->total_frames);
            }
        }
    }
    else if (ctx->is_photo_mode)
    {
        should_continue = (ctx->sent_bytes < ctx->photo_size);
    }
    else
    {
        should_continue = (--ctx->remaining > 0);
    }

    if (should_continue)
    {
        /* 次回も tcpip_thread のタイマで */
        sys_timeout(next_interval, udp_send_timer_cb, ctx);
    }
    else
    {
        if (ctx->is_video_mode)
        {
            xprintf("[VIDEO] transmission complete: %u frames\n", ctx->total_frames);
        }
        else if (ctx->is_photo_mode)
        {
            xprintf("[PHOTO] transmission complete: %u bytes\n", ctx->sent_bytes);
        }
        else
        {
            xprintf("[UDP] done\n");
        }
        udp_remove(ctx->pcb);
        ctx->pcb = NULL;
        // 静的メモリなのでvPortFreeは不要
    }
}

/* ====== netif ステータスコールバック(tcpip_thread から呼ばれる) ====== */
static void netif_status_cb(struct netif *n)
{
    if (!ip4_addr_isany_val(*netif_ip4_addr(n)))
    {
        if (g_ip_ready_sem)
        {
            xSemaphoreGive(g_ip_ready_sem);
        }
    }
}

void main_thread1_entry(void *pvParameters)
{
    FSP_PARAMETER_NOT_USED(pvParameters);

    // LAN8720A Reset
    R_BSP_PinAccessEnable();
    R_BSP_PinWrite(LAN8720_nRST, BSP_IO_LEVEL_LOW);
    vTaskDelay(pdMS_TO_TICKS(300));
    R_BSP_PinWrite(LAN8720_nRST, BSP_IO_LEVEL_HIGH);
    vTaskDelay(pdMS_TO_TICKS(300));

    xprintf("[ETH] LAN8720A Ready\n");

    /* netif 準備 */
    struct netif netif;
    ip4_addr_t ipaddr, netmask, gw;
    ip4_addr_set_zero(&ipaddr);
    ip4_addr_set_zero(&netmask);
    ip4_addr_set_zero(&gw);

    IP_ADDR4(&ipaddr, 0, 0, 0, 0);  // IPADDR_ANY
    IP_ADDR4(&netmask, 0, 0, 0, 0); // IPADDR_ANY
    IP_ADDR4(&gw, 0, 0, 0, 0);      // IPADDR_ANY

