panda5mt/RA8E1_prj/src/main_thread1_entry.c
    /* LwIP: tcpip_thread を起動(以後のタイマ/DHCP/ARP はこのスレッドが管理) */
    tcpip_init(NULL, NULL);

    vTaskDelay(pdMS_TO_TICKS(100)); // ← tcpip_thread 起動を待つ

    /* rm_lwip_ether 初期化(input は tcpip_input を指定) */
    netif_add(&netif, &ipaddr, &netmask, &gw,
              &g_lwip_ether0_instance, /* ← プロジェクト固有．名前が違う場合は置換 */
              rm_lwip_ether_init,
              tcpip_input);
    netif_set_default(&netif);

    /* IP 取得通知のためのステータスコールバック登録 */
    g_ip_ready_sem = xSemaphoreCreateBinary();
    netif_set_status_callback(&netif, netif_status_cb);

    /* Link/IF Up は netifapi_* でスレッド安全に */
    netifapi_netif_set_up(&netif);
    netifapi_netif_set_link_up(&netif);

    /* DHCP 開始(tcpip_thread に依頼) */
    netifapi_dhcp_start(&netif);

    /* DHCP 完了待ち(sys_check_timeouts は不要) */
    if (xSemaphoreTake(g_ip_ready_sem, pdMS_TO_TICKS(20000)) == pdTRUE)
    {
        xprintf("[LwIP] DHCP IP: %s\n", ip4addr_ntoa(netif_ip4_addr(&netif)));
    }
    else
    {
#if LWIP_AUTOIP
        xprintf("[LwIP] DHCP timeout: AutoIP start...\n");

        /* AutoIP can occasionally time out; retry a couple times. */
        const uint32_t autoip_timeout_ms = 10000U;
        const uint32_t autoip_retries = 2U;
        bool got_ip = false;

        for (uint32_t attempt = 0; attempt <= autoip_retries; attempt++)
        {
            if (attempt > 0)
            {
                xprintf("[LwIP] AutoIP retry %lu/%lu...\n",
                        (unsigned long)attempt,
                        (unsigned long)autoip_retries);
            }

            /* (Re)start AutoIP negotiation. */
            netifapi_autoip_stop(&netif);
            vTaskDelay(pdMS_TO_TICKS(50));
            netifapi_autoip_start(&netif);

            (void)xSemaphoreTake(g_ip_ready_sem, pdMS_TO_TICKS(autoip_timeout_ms));
            if (!ip4_addr_isany_val(*netif_ip4_addr(&netif)))
            {
                got_ip = true;
                break;
            }
        }

        if (got_ip)
        {
            xprintf("[LwIP] AutoIP IP: %s\n", ip4addr_ntoa(netif_ip4_addr(&netif)));
        }
        else
        {
            xprintf("[LwIP] AutoIP timeout (retries=%lu)\n", (unsigned long)autoip_retries);
        }
#else
        xprintf("[LwIP] DHCP timeout (AUTOIP disabled)\n");
#endif
    }

    /* ====== UDP：受信コールバック＋送信を sys_timeout で ====== */
    if (!ip4_addr_isany_val(*netif_ip4_addr(&netif)))
    {

        /* サブネットブロードキャストを計算 */
        ip4_addr_t bcast4;
        {
            u32_t ip = ip4_addr_get_u32(netif_ip4_addr(&netif));
            u32_t mask = ip4_addr_get_u32(netif_ip4_netmask(&netif));
            ip4_addr_set_u32(&bcast4, (ip & mask) | ~mask);
        }
        ip_addr_t dest_ip;
        ip_addr_copy_from_ip4(dest_ip, bcast4);

        /* PCB 生成・受信ポートに bind(受信も見たい場合) */
        struct udp_pcb *pcb = udp_new();
        if (!pcb)
        {
            xprintf("[UDP] udp_new failed\n");
            goto forever;
        }

        if (udp_bind(pcb, IP_ADDR_ANY, UDP_PORT_DEST) != ERR_OK)
        {
            xprintf("[UDP] bind failed\n");
            udp_remove(pcb);
            goto forever;
        }

        /* 受信コールバック登録 */
        udp_recv(pcb, udp_rx_cb, NULL);

        /* 送信用コンテキストを静的メモリで使用 */
        udp_send_ctx_t *ctx = &g_udp_send_ctx;
        memset(ctx, 0, sizeof(*ctx));
        ctx->pcb = pcb;
        ctx->dest_ip = dest_ip;
        ctx->port = UDP_PORT_DEST;
        ctx->interval_ms = UDP_PACKET_INTERVAL_MS;

        // 動画データ送信モード(グレースケール送信：Y成分のみ)
        ctx->is_video_mode = true;
        ctx->is_photo_mode = false;
        ctx->photo_data = (uint8_t *)HYPERRAM_BASE_ADDR; // 使用しない(hyperram_b_readで直接指定)
        ctx->photo_size = 320 * 240;                     // グレースケール: 320x240x1 = 76,800 bytes
        ctx->sent_bytes = 0;
        ctx->chunk_size = 512; // 512バイトずつ送信

        // マルチフレーム設定
        ctx->current_frame = 0;
        ctx->total_frames = UINT32_MAX; // 無制限フレーム送信
        ctx->frame_interval_ms = UDP_FRAME_INTERVAL_MS;
        ctx->is_frame_complete = false;
        ctx->frame_base_offset = (uint32_t)g_video_frame_base_offset;

        xprintf("[VIDEO] Starting grayscale transmission (Y component):\n %d bytes/frame, %d chunks/frame\n",
                ctx->photo_size, (ctx->photo_size + ctx->chunk_size - 1) / ctx->chunk_size);

        /* 1発目をスケジュール(ネットワーク安定化のため500ms待機) */
        sys_timeout(500, udp_send_timer_cb, ctx);
    }

forever:
    while (1)
    {
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

#endif /* APP_MODE_FFT_VERIFY */
